---
kind: property
id: P:Autodesk.Revit.DB.CylindricalSurface.YDir
source: html/f2eacbac-50ab-a937-9d95-062e8bc631d9.htm
---
# Autodesk.Revit.DB.CylindricalSurface.YDir Property

Y axis of the local coordinate system associated with this cylinder.

## Syntax (C#)
```csharp
public XYZ YDir { get; }
```